In [1]:
#I was given two different lists in excel of employees who should receive the vaccination report. 
#My task is to delete all last names. Check out this tutorial: https://www.youtube.com/watch?v=HU0re8UJViM
import pandas as pd
excel_file_path = 'Dir+.xlsx'
df = pd.read_excel(excel_file_path)

In [2]:
df

             Full Name
0     Agarwal, Avdhesh
1      Agrawal, Yogesh
2         Ahmad, Jalal
3    Ahmed, Mohd. Arif
4         Ahuja, Ankur
..                 ...
134       Yilmaz, Ebru
135      Yilmaz, Murat
136     Zambrana, Eric
137   Zunaid, Mohammad
138                 43

[139 rows x 1 columns]

In [3]:
#Something cool we can do is to remove the comma
df['Full Name']

0       Agarwal, Avdhesh
1        Agrawal, Yogesh
2           Ahmad, Jalal
3      Ahmed, Mohd. Arif
4           Ahuja, Ankur
             ...
134         Yilmaz, Ebru
135        Yilmaz, Murat
136       Zambrana, Eric
137     Zunaid, Mohammad
138                   43
Name: Full Name, Length: 139, dtype: object

In [4]:
df['Full Name'].str.split()

0        [Agarwal,, Avdhesh]
1         [Agrawal,, Yogesh]
2            [Ahmad,, Jalal]
3      [Ahmed,, Mohd., Arif]
4            [Ahuja,, Ankur]
               ...
134          [Yilmaz,, Ebru]
135         [Yilmaz,, Murat]
136        [Zambrana,, Eric]
137      [Zunaid,, Mohammad]
138                      NaN
Name: Full Name, Length: 139, dtype: object

In [5]:
df['Full Name'].str.split()[0][0]

'Agarwal,'

Now, what if I wanted to delete all last names????
One way to go about it is to  look at the content in every row as a list [lastName, firstName].
Then I could slice or split the list at the comma. Then I would delete everythin from the beginning of the list to the comma, 
including the comma

In [7]:
my_str = df['Full Name'][0]

In [8]:
my_str

'Agarwal, Avdhesh'

In [9]:
# Now that I got a string I can apply the split method

In [10]:
my_str.split()

['Agarwal,', 'Avdhesh']

In [11]:
my_list = my_str.split()

In [12]:
my_list

['Agarwal,', 'Avdhesh']